# GetAllObjects Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCProductWrapper..::..GetAllObjects Method
IFCProductWrapper Class See Also
---
Gets all objects associated with the IfcProduct in this wrapper.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ICollection<IFCAnyHandle> GetAllObjects()
```

Visual Basic
---
```text
Public Function GetAllObjects As ICollection(Of IFCAnyHandle)
```

Visual C++
---
```text
public:
ICollection<IFCAnyHandle^>^ GetAllObjects()
```

# ### Return Value
The collection of objects.
# See Also
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace